[
  {
    "id": "rootCanalNotFinished",
    "title": {
      "en": "Incomplete Root Canal",
      "de": "Unvollständige Wurzelbehandlung",
      "fr": "Traitement de canal incomplet",
      "ar": "علاج عصب غير مكتمل"
    },
    "explanation": {
      "en": "The root canal treatment is not yet completed. The tooth canals are likely still infected.",
      "de": "Die Wurzelkanalbehandlung ist noch nicht abgeschlossen. Die Wurzelkanäle sind wahrscheinlich entzündet.",
      "fr": "Le traitement de canal n’est pas terminé. Les canaux sont probablement encore infectés.",
      "ar": "لم يكتمل علاج العصب بعد. من المحتمل أن تكون القنوات لا تزال ملتهبة."
    },
    "treatment": {
      "en": "The root canal treatment must be completed as soon as possible. Antibiotics might be necessary, but they should never be taken without a dentist's prescription and consultation.",
      "de": "Die Wurzelkanalbehandlung muss so schnell wie möglich abgeschlossen werden. Möglicherweise sind Antibiotika erforderlich, diese dürfen jedoch niemals ohne zahnärztliche Anweisung eingenommen werden.",
      "fr": "Il faut terminer le traitement de canal dès que possible. Des antibiotiques peuvent être nécessaires, mais ne doivent jamais être pris sans l'avis et la prescription d'un dentiste.",
      "ar": "يجب إتمام علاج قناة الجذر في أسرع وقت ممكن. قد تكون المضادات الحيوية ضرورية، ولكن لا يجب تناولها أبدًا بدون استشارة ووصفة من طبيب الأسنان."
    }
  },
  {
    "id": "deepFilling",
    "title": {
      "en": "Possible Irreversible Pulpitis",
      "de": "Mögliche irreversible Pulpitis",
      "fr": "Pulpite irréversible possible",
      "ar": "التهاب لب السن اللاعكوس المحتمل"
    },
    "explanation": {
      "en": "A deep filling is close to the nerve, which may cause inflammation (pulpitis).",
      "de": "Eine tiefe Füllung liegt nahe am Nerv, was eine Entzündung (Pulpitis) verursachen kann.",
      "fr": "Une obturation profonde est proche du nerf, ce qui peut provoquer une inflammation (pulpite).",
      "ar": "الحشوة العميقة قريبة من العصب، مما قد يسبب التهابًا (التهاب العصب)."
    },
    "treatment": {
      "en": "A root canal treatment is likely necessary to save the tooth.",
      "de": "Eine Wurzelkanalbehandlung ist wahrscheinlich notwendig, um den Zahn zu retten.",
      "fr": "Un traitement de canal est probablement nécessaire pour sauver la dent.",
      "ar": "من المرجح أن يكون علاج قناة الجذر ضروريًا لإنقاذ السن."
    }
  },
  {
    "id": "fillingBroken",
    "title": {
      "en": "Broken Filling",
      "de": "Defekte Füllung",
      "fr": "Obturation cassée",
      "ar": "حشوة مكسورة"
    },
    "explanation": {
      "en": "The filling is broken, which can lead to new decay or sensitivity.",
      "de": "Die Füllung ist abgebrochen, was zu neuer Karies oder Empfindlichkeit führen kann.",
      "fr": "L'obturation est cassée, ce qui peut entraîner une nouvelle carie ou une sensibilité.",
      "ar": "الحشوة مكسورة، مما قد يؤدي إلى تسوس جديد أو حساسية."
    },
    "treatment": {
      "en": "A new filling is required.",
      "de": "Eine neue Füllung ist erforderlich.",
      "fr": "Une nouvelle obturation est nécessaire.",
      "ar": "يلزم وضع حشوة جديدة."
    }
  },
  {
    "id": "crownFell",
    "title": {
      "en": "Crown Fell Off",
      "de": "Krone herausgefallen",
      "fr": "Couronne tombée",
      "ar": "سقوط التاج"
    },
    "explanation": {
      "en": "The crown has fallen off, exposing the underlying tooth structure.",
      "de": "Die Krone ist herausgefallen und legt die darunterliegende Zahnstruktur frei.",
      "fr": "La couronne est tombée, exposant la structure dentaire sous-jacente.",
      "ar": "سقط التاج، مما يكشف عن بنية السن الأساسية."
    },
    "treatment": {
      "en": "The crown must be reattached or replaced. Keep the crown and see a dentist.",
      "de": "Die Krone muss wieder befestigt oder ersetzt werden. Bewahren Sie die Krone auf und suchen Sie einen Zahnarzt auf.",
      "fr": "La couronne doit être recollée ou remplacée. Conservez la couronne et consultez un dentiste.",
      "ar": "يجب إعادة تثبيت التاج أو استبداله. احتفظ بالتاج وراجع طبيب الأسنان."
    }
  },
  {
    "id": "crownBroken",
    "title": {
      "en": "Broken Crown",
      "de": "Krone gebrochen",
      "fr": "Couronne cassée",
      "ar": "تاج مكسور"
    },
    "explanation": {
      "en": "The crown is broken, which can have sharp edges and no longer protects the tooth.",
      "de": "Die Krone ist beschädigt, was scharfe Kanten haben kann und den Zahn nicht mehr schützt.",
      "fr": "La couronne est cassée, ce qui peut présenter des bords tranchants et ne protège plus la dent.",
      "ar": "التاج مكسور، مما قد يكون له حواف حادة ولم يعد يحمي السن."
    },
    "treatment": {
      "en": "A new crown must be made.",
      "de": "Eine neue Krone muss angefertigt werden.",
      "fr": "Une nouvelle couronne doit être fabriquée.",
      "ar": "يجب عمل تاج جديد."
    }
  },
  {
    "id": "rctFinishedStillPain",
    "title": {
      "en": "Root Canal Treated Tooth with Persistent Issues",
      "fr": "Dent traitée par canal avec problèmes persistants",
      "de": "Wurzelkanalbehandelter Zahn mit anhaltenden Problemen",
      "ar": "سن معالج بقناة الجذر بمشاكل مستمرة"
    },
    "explanation": {
      "en": "Despite completed root canal treatment, the tooth still presents issues, possibly indicating a need for retreatment or extraction.",
      "fr": "Malgré un traitement de canal terminé, la dent présente toujours des problèmes, indiquant peut-être un besoin de retraitement ou d'extraction.",
      "de": "Trotz abgeschlossener Wurzelkanalbehandlung weist der Zahn weiterhin Probleme auf, was möglicherweise auf die Notwendigkeit einer Revision oder Extraktion hindeutet.",
      "ar": "على الرغم من اكتمال علاج قناة الجذر، لا يزال السن يعاني من مشاكل، مما قد يشير إلى الحاجة إلى إعادة العلاج أو الخلع."
    },
    "treatment": {
      "en": "A dentist may consider prescribing antibiotics. This would be followed by a root canal revision or tooth extraction. Antibiotics should only be taken as prescribed by a dentist.",
      "fr": "Un dentiste peut envisager de prescrire des antibiotiques. Ceci serait suivi d'une révision du traitement de canal ou d'une extraction dentaire. Les antibiotiques ne doivent être pris que sur prescription d'un dentiste.",
      "de": "Ein Zahnarzt kann die Verschreibung von Antibiotika in Betracht ziehen. Darauf würde eine Wurzelkanalrevision oder eine Zahnextraktion folgen. Antibiotika dürfen nur nach zahnärztlicher Vorschrift eingenommen werden.",
      "ar": "قد يرى طبيب الأسنان وصف المضادات الحيوية. ويلي ذلك إعادة علاج قناة الجذر أو خلع السن. لا يجب تناول المضادات الحيوية إلا بوصفة طبية."
    }
  },
  {
    "id": "gingivitis",
    "title": {
      "en": "Gingivitis (Gum Inflammation)",
      "fr": "Gingivite (Inflammation des gencives)",
      "de": "Gingivitis (Zahnfleischentzündung)",
      "ar": "التهاب اللثة"
    },
    "explanation": {
      "en": "Gingivitis is a common and mild form of gum disease that causes irritation, redness and swelling of your gingiva, the part of your gum around the base of your teeth.",
      "fr": "La gingivite est une forme courante et bénigne de maladie des gencives qui provoque une irritation, une rougeur et un gonflement de votre gencive, la partie de votre gencive autour de la base de vos dents.",
      "de": "Gingivitis ist eine häufige und milde Form der Zahnfleischerkrankung. Sie verursacht Reizungen, Rötungen und Schwellungen des Zahnfleisches, insbesondere am Zahnfleischsaum.",
      "ar": "التهاب اللثة هو شكل شائع وخفيف من أمراض اللثة يسبب تهيجًا واحمرارًا وتورمًا في اللثة، وهو الجزء من اللثة حول قاعدة الأسنان."
    },
    "treatment": {
      "en": "Improved oral hygiene, including regular brushing and flossing, and professional dental cleaning.",
      "fr": "Amélioration de l'hygiène bucco-dentaire, y compris un brossage et une utilisation du fil dentaire réguliers, et un nettoyage dentaire professionnel.",
      "de": "Eine verbesserte Mundhygiene ist erforderlich. Dazu gehören regelmäßiges Zähneputzen, die Verwendung von Zahnseide und eine professionelle Zahnreinigung.",
      "ar": "تحسين نظافة الفم، بما في ذلك تنظيف الأسنان بالفرشاة والخيط بانتظام، وتنظيف الأسنان الاحترافي."
    }
  },
  {
    "id": "periodontitis",
    "title": {
      "en": "Periodontitis (Advanced Gum Disease)",
      "fr": "Parodontite (Maladie des gencives avancée)",
      "de": "Parodontitis (Fortgeschrittene Zahnfleischerkrankung)",
      "ar": "التهاب دواعم السن (مرض اللثة المتقدم)"
    },
    "explanation": {
      "en": "Periodontitis is a serious gum infection that damages the soft tissue and, without treatment, can destroy the bone that supports your teeth. It can lead to tooth loss.",
      "fr": "La parodontite est une infection grave des gencives qui endommage les tissus mous et, sans traitement, peut détruire l'os qui soutient vos dents. Elle peut entraîner la perte des dents.",
      "de": "Parodontitis ist eine schwere Zahnfleischentzündung, die das Weichgewebe schädigt und ohne Behandlung den Knochen zerstören kann, der Ihre Zähne stützt. Sie kann zu Zahnverlust führen.",
      "ar": "التهاب دواعم السن هو عدوى خطيرة في اللثة تلحق الضرر بالأنسجة الرخوة، وبدون علاج، يمكن أن تدمر العظم الذي يدعم أسنانك. يمكن أن يؤدي إلى فقدان الأسنان."
    },
    "treatment": {
      "en": "Deep cleaning (scaling and root planing), medication, and possibly surgery. Regular follow-up with a periodontist.",
      "fr": "Nettoyage en profondeur (détartrage et surfaçage radiculaire), médicaments et éventuellement chirurgie. Suivi régulier avec un parodontiste.",
      "de": "Eine Tiefenreinigung (Scaling und Root Planing), Medikamente und eventuell chirurgische Eingriffe sind notwendig. Regelmäßige Kontrolltermine bei einem Zahnarzt oder Parodontologen sind entscheidend.",
      "ar": "تنظيف عميق (تقليح وكشط الجذور)، أدوية، وربما جراحة. متابعة منتظمة مع أخصائي اللثة."
    }
  },
  {
    "id": "healthy_gums",
    "title": {
      "en": "Healthy Gums",
      "fr": "Gencives saines",
      "de": "Gesundes Zahnfleisch",
      "ar": "لثة صحية"
    },
    "explanation": {
      "en": "Based on your answers, your gums appear to be healthy. There are no signs of common gum diseases.",
      "fr": "D'après vos réponses, vos gencives semblent être en bonne santé. Il n'y a aucun signe de maladie des gencives courante.",
      "de": "Basierend auf Ihren Antworten scheint Ihr Zahnfleisch gesund zu sein. Es gibt keine Anzeichen für häufige Zahnfleischerkrankungen.",
      "ar": "بناءً على إجاباتك، تبدو لثتك صحية. لا توجد علامات على أمراض اللثة الشائعة."
    },
    "treatment": {
      "en": "Continue with good oral hygiene, including regular brushing and flossing, to maintain gum health.",
      "fr": "Continuez avec une bonne hygiène bucco-dentaire, y compris un brossage et une utilisation du fil dentaire réguliers, pour maintenir la santé de vos gencives.",
      "de": "Führen Sie Ihre gute Mundhygiene fort. Dazu gehören regelmäßiges Zähneputzen und die Verwendung von Zahnseide, um die Gesundheit Ihres Zahnfleisches zu erhalten.",
      "ar": "استمر في نظافة الفم الجيدة، بما في ذلك تنظيف الأسنان بالفرشاة والخيط بانتظام، للحفاظ على صحة لثتك."
    }
  },
  {
    "id": "bruxism",
    "title": {
      "en": "Bruxism (Teeth Grinding)",
      "fr": "Bruxisme (Grincement des dents)",
      "de": "Bruxismus (Zähneknirschen)",
      "ar": "صريف الأسنان (طحن الأسنان)"
    },
    "explanation": {
      "en": "Bruxism is a condition in which you grind, gnash or clench your teeth. This can happen during the day or, more commonly, during sleep. It often leads to jaw pain, headaches, and worn-down teeth.",
      "fr": "Le bruxisme est une condition dans laquelle vous grincez, serrez ou serrez les dents. Cela peut se produire pendant la journée ou, plus communément, pendant le sommeil. Il entraîne souvent des douleurs à la mâchoire, des maux de tête et une usure des dents.",
      "de": "Bruxismus ist ein Zustand, bei dem Sie mit den Zähnen knirschen, mahlen oder pressen. Dies kann tagsüber oder, häufiger, im Schlaf geschehen. Es führt oft zu Kieferschmerzen, Kopfschmerzen und abgenutzten Zähnen.",
      "ar": "صريف الأسنان هو حالة تقوم فيها بطحن أو صرير أو إطباق أسنانك. يمكن أن يحدث هذا خلال النهار أو، بشكل أكثر شيوعًا، أثناء النوم. غالبًا ما يؤدي إلى ألم في الفك وصداع وتآكل الأسنان."
    },
    "treatment": {
      "en": "The primary treatment is a custom-made night guard (occlusal splint) to protect your teeth from grinding. If symptoms persist, physiotherapy may be recommended to relieve muscle tension.",
      "fr": "Le traitement principal est une gouttière occlusale sur mesure pour protéger vos dents du grincement. Si les symptômes persistent, la physiothérapie peut être recommandée pour soulager la tension musculaire.",
      "de": "Die primäre Behandlung ist eine individuell angefertigte Knirschschiene (Okklusionsschiene), um Ihre Zähne vor dem Knirschen zu schützen. Wenn die Symptome anhalten, kann Physiotherapie empfohlen werden, um Muskelverspannungen zu lösen.",
      "ar": "العلاج الأساسي هو واقي ليلي مصنوع خصيصًا (جبيرة إطباقية) لحماية أسنانك من الطحن. إذا استمرت الأعراض، فقد يوصى بالعلاج الطبيعي لتخفيف توتر العضلات."
    }
  },
  {
    "id": "tmj_disorder",
    "title": {
      "en": "Temporomandibular Joint Disorder",
      "fr": "Trouble de l'articulation temporo-mandibulaire",
      "de": "Kiefergelenkerkrankung",
      "ar": "اضطراب المفصل الفكي الصدغي"
    },
    "explanation": {
      "en": "Your symptoms, such as pain and clicking, are typical for a temporomandibular joint disorder.",
      "fr": "Vos symptômes, tels que la douleur et les claquements, sont typiques d'un trouble de l'articulation temporo-mandibulaire.",
      "de": "Ihre Symptome wie Schmerzen und Kieferknacken sind typisch für eine Kiefergelenkerkrankung.",
      "ar": "أعراضك، مثل الألم والطقطقة، نموذجية لاضطراب المفصل الفكي الصدغي."
    },
    "treatment": {
      "en": "Physiotherapy and massages can help relieve the symptoms. A custom-made night guard (occlusal splint) can also be beneficial. Please consult a dentist for an accurate diagnosis and treatment plan.",
      "fr": "La physiothérapie et les massages peuvent aider à soulager les symptômes. Une gouttière occlusale sur mesure peut également être bénéfique. Veuillez consulter un dentiste pour un diagnostic précis et un plan de traitement.",
      "de": "Physiotherapie und Massagen können helfen, die Symptome zu lindern. Eine individuell angefertigte Knirschschiene kann ebenfalls nützlich sein. Bitte konsultieren Sie einen Zahnarzt für eine genaue Diagnose und einen Behandlungsplan.",
      "ar": "يمكن أن يساعد العلاج الطبيعي والتدليك في تخفيف الأعراض. يمكن أن يكون واقي الأسنان الليلي المصنوع خصيصًا مفيدًا أيضًا. يرجى استشارة طبيب الأسنان للحصول على تشخيص دقيق وخطة علاج."
    }
  },
  {
    "id": "tmj_disorder_with_limitation",
    "title": {
      "en": "Temporomandibular Joint Disorder with Limited Opening",
      "fr": "Trouble de l'articulation temporo-mandibulaire avec ouverture limitée",
      "de": "Kiefergelenkerkrankung mit eingeschränkter Mundöffnung",
      "ar": "اضطراب المفصل الفكي الصدغي مع فتحة محدودة"
    },
    "explanation": {
      "en": "Your symptoms, especially the limited mouth opening, indicate a temporomandibular joint disorder. This can be caused by a displacement of the articular disc.",
      "fr": "Vos symptômes, en particulier l'ouverture limitée de la bouche, indiquent un trouble de l'articulation temporo-mandibulaire. Cela peut être dû à un déplacement du disque articulaire.",
      "de": "Ihre Symptome, insbesondere die eingeschränkte Mundöffnung, deuten auf eine Kiefergelenkerkrankung hin. Dies kann durch eine Verlagerung der Gelenkscheibe (Diskus) verursacht werden.",
      "ar": "أعراضك، وخاصة فتحة الفم المحدودة، تشير إلى اضطراب في المفصل الفكي الصدغي. يمكن أن يكون سبب ذلك هو إزاحة القرص المفصلي."
    },
    "treatment": {
      "en": "It is strongly recommended to see a dentist. Possible treatments include physiotherapy, special splints, or other dental procedures.",
      "fr": "Il est fortement recommandé de consulter un dentiste. Les traitements possibles comprennent la physiothérapie, des gouttières spéciales ou d'autres procédures dentaires.",
      "de": "Es wird dringend empfohlen, einen Zahnarzt aufzusuchen. Mögliche Behandlungen umfassen Physiotherapie, spezielle Schienen oder andere zahnärztliche Eingriffe.",
      "ar": "يوصى بشدة بزيارة طبيب الأسنان. تشمل العلاجات الممكنة العلاج الطبيعي أو الجبائر الخاصة أو إجراءات طب الأسنان الأخرى."
    }
  },
  {
    "id": "tmj_muscle_pain",
    "title": {
      "en": "Myofascial Pain (Muscle Pain)",
      "fr": "Douleur myofasciale (Douleur musculaire)",
      "de": "Myofaszialer Schmerz (Muskelschmerz)",
      "ar": "الألم العضلي الليفي (ألم العضلات)"
    },
    "explanation": {
      "en": "Your pain seems to originate mainly from the chewing muscles. This is a common form of temporomandibular joint disorder.",
      "fr": "Votre douleur semble provenir principalement des muscles de la mastication. C'est une forme courante de trouble de l'articulation temporo-mandibulaire.",
      "de": "Ihre Schmerzen scheinen hauptsächlich von den Kaumuskeln auszugehen. Dies ist eine häufige Form von Kiefergelenksbeschwerden.",
      "ar": "يبدو أن ألمك ينشأ بشكل أساسي من عضلات المضغ. هذا شكل شائع من اضطراب المفصل الفكي الصدغي."
    },
    "treatment": {
      "en": "Relaxation exercises, gentle massage of the jaw muscles, and heat applications can provide relief. For persistent pain, splint therapy or physiotherapy may be useful. Consult your dentist.",
      "fr": "Des exercices de relaxation, un massage doux des muscles de la mâchoire et des applications de chaleur peuvent apporter un soulagement. En cas de douleur persistante, une thérapie par gouttière ou la physiothérapie peuvent être utiles. Consultez votre dentiste.",
      "de": "Entspannungsübungen, sanfte Massagen der Kaumuskulatur und Wärmeanwendungen können Linderung verschaffen. Bei anhaltenden Schmerzen kann eine Schienentherapie oder Physiotherapie sinnvoll sein. Konsultieren Sie Ihren Zahnarzt.",
      "ar": "يمكن أن توفر تمارين الاسترخاء والتدليك اللطيف لعضلات الفك وتطبيقات الحرارة الراحة. بالنسبة للألم المستمر، قد يكون العلاج بالجبيرة أو العلاج الطبيعي مفيدًا. استشر طبيب أسنانك."
    }
  },
  {
    "id": "no_tmj_disorder",
    "title": {
      "en": "No Temporomandibular Joint Disorder indicated",
      "fr": "Aucun trouble de l'articulation temporo-mandibulaire indiqué",
      "de": "Keine Kiefergelenksbeschwerden",
      "ar": "لا يوجد ما يشير إلى اضطراب المفصل الفكي الصدغي"
    },
    "explanation": {
      "en": "Based on your answers, there are no typical symptoms of a temporomandibular joint disorder.",
      "fr": "D'après vos réponses, il n'y a pas de symptômes typiques d'un trouble de l'articulation temporo-mandibulaire.",
      "de": "Basierend auf Ihren Antworten scheinen keine typischen Symptome einer Kiefergelenkerkrankung vorzuliegen.",
      "ar": "بناءً على إجاباتك، لا توجد أعراض نموذجية لاضطراب المفصل الفكي الصدغي."
    },
    "treatment": {
      "en": "No treatment is necessary. However, if you still have concerns, please consult your dentist.",
      "fr": "Aucun traitement n'est nécessaire. Cependant, si vous avez toujours des inquiétudes, veuillez consulter votre dentiste.",
      "de": "Keine Behandlung erforderlich. Wenn Sie dennoch Bedenken haben, konsultieren Sie bitte Ihren Zahnarzt.",
      "ar": "لا حاجة للعلاج. ومع ذلك، إذا كان لا يزال لديك مخاوف، يرجى استشارة طبيب أسنانك."
    }
  },
  {
    "id": "mobility_grade_1",
    "title": {
      "en": "Slight Tooth Mobility (Grade 1)",
      "de": "Leichte Zahnbeweglichkeit (Grad 1)",
      "fr": "Mobilité dentaire légère (Grade 1)",
      "ar": "حركة طفيفة في السن (درجة 1)"
    },
    "explanation": {
      "en": "The tooth has slightly more movement than normal. This is often an early sign of gum disease or excessive biting forces (occlusal trauma).",
      "de": "Der Zahn hat etwas mehr Bewegung als normal. Dies ist oft ein frühes Anzeichen für eine Zahnfleischerkrankung oder übermäßige Bisskräfte (okklusales Trauma).",
      "fr": "La dent a un mouvement légèrement supérieur à la normale. C'est souvent un signe précoce de maladie des gencives ou de forces de morsure excessives (traumatisme occlusal).",
      "ar": "السن لديه حركة أكثر بقليل من المعتاد. هذه غالباً علامة مبكرة على مرض اللثة أو قوى العض المفرطة (صدمة إطباقية)."
    },
    "treatment": {
      "en": "A professional dental cleaning (scaling) is necessary. The bite might need to be adjusted. Sometimes, splinting the tooth to its neighbors can provide stability.",
      "de": "Eine professionelle Zahnreinigung (Scaling) ist notwendig. Möglicherweise muss der Biss angepasst werden. Manchmal kann das Schienen des Zahnes an die Nachbarzähne für Stabilität sorgen.",
      "fr": "Un nettoyage dentaire professionnel (détartrage) est nécessaire. L'occlusion peut nécessiter un ajustement. Parfois, la contention (solidarisation) de la dent à ses voisines peut aider à la stabiliser.",
      "ar": "من الضروري إجراء تنظيف احترافي للأسنان (إزالة الجير). قد يحتاج الإطباق إلى تعديل. في بعض الأحيان، يمكن أن يساعد تثبيت السن بالأسنان المجاورة على استقراره."
    }
  },
  {
    "id": "mobility_grade_2",
    "title": {
      "en": "Moderate Tooth Mobility (Grade 2)",
      "de": "Mäßige Zahnbeweglichkeit (Grad 2)",
      "fr": "Mobilité dentaire modérée (Grade 2)",
      "ar": "حركة متوسطة في السن (درجة 2)"
    },
    "explanation": {
      "en": "The tooth has noticeable movement (up to 1mm horizontally). This indicates significant loss of bone support, usually due to advanced gum disease (periodontitis).",
      "de": "Der Zahn hat eine merkliche Bewegung (bis zu 1 mm horizontal). Dies deutet auf einen erheblichen Verlust des Knochenhalts hin, normalerweise aufgrund einer fortgeschrittenen Zahnfleischerkrankung (Parodontitis).",
      "fr": "La dent a un mouvement notable (jusqu'à 1 mm horizontalement). Cela indique une perte significative de soutien osseux, généralement due à une maladie des gencives avancée (parodontite).",
      "ar": "السن لديه حركة ملحوظة (تصل إلى 1 مم أفقيًا). هذا يشير إلى فقدان كبير في دعم العظام، وعادة ما يكون بسبب مرض اللثة المتقدم (التهاب دواعم السن)."
    },
    "treatment": {
      "en": "Requires immediate dental intervention. This includes deep cleaning (scaling and root planing) and splinting the tooth to adjacent teeth. Periodontal surgery may be required.",
      "de": "Erfordert eine sofortige zahnärztliche Behandlung. Diese umfasst eine Tiefenreinigung (Scaling und Root Planing) und das Schienen des Zahnes an die Nachbarzähne. Möglicherweise ist eine Parodontalchirurgie erforderlich.",
      "fr": "Nécessite une intervention dentaire immédiate. Cela comprend un nettoyage en profondeur (détartrage et surfaçage radiculaire) et la ligature de la dent aux dents adjacentes. Une chirurgie parodontale peut être nécessaire.",
      "ar": "يتطلب تدخلًا فوريًا من طبيب الأسنان. يشمل ذلك التنظيف العميق (تقليح وكشط الجذور) وربط السن بالأسنان المجاورة. قد تكون هناك حاجة لجراحة اللثة."
    }
  },
  {
    "id": "mobility_grade_3",
    "title": {
      "en": "Severe Tooth Mobility (Grade 3)",
      "de": "Starke Zahnbeweglichkeit (Grad 3)",
      "fr": "Mobilité dentaire sévère (Grade 3)",
      "ar": "حركة شديدة في السن (درجة 3)"
    },
    "explanation": {
      "en": "The tooth is very loose, moves more than 1mm horizontally, and can be moved vertically. The prognosis is very poor due to extreme bone loss.",
      "de": "Der Zahn ist sehr locker, bewegt sich mehr als 1 mm horizontal und kann vertikal bewegt werden. Die Prognose ist aufgrund des extremen Knochenverlusts sehr schlecht.",
      "fr": "La dent est très mobile, se déplace de plus de 1 mm horizontalement et peut être déplacée verticalement. Le pronostic est très mauvais en raison d'une perte osseuse extrême.",
      "ar": "السن فضفاض جدًا، يتحرك أكثر من 1 مم أفقيًا، ويمكن تحريكه عموديًا. التكهن سيء للغاية بسبب الفقدان الشديد للعظام."
    },
    "treatment": {
      "en": "Extraction of the tooth is the most common and often necessary treatment to prevent further complications. After extraction, options for replacement like an implant, a bridge, or a partial denture should be discussed.",
      "de": "Die Extraktion des Zahnes ist die häufigste und oft notwendige Behandlung, um weitere Komplikationen zu verhindern. Nach der Extraktion sollten Optionen für einen Ersatz wie ein Implantat, eine Brücke oder eine Teilprothese besprochen werden.",
      "fr": "L'extraction de la dent est le traitement le plus courant et souvent nécessaire pour prévenir d'autres complications. Après l'extraction, des options de remplacement comme un implant, un pont ou une prothèse partielle doivent être discutées.",
      "ar": "خلع السن هو العلاج الأكثر شيوعًا وغالبًا ما يكون ضروريًا لمنع المزيد من المضاعفات. بعد الخلع، يجب مناقشة خيارات الاستبدال مثل الزرع أو الجسر أو طقم الأسنان الجزئي."
    }
  },
  {
    "id": "irreversible_pulpitis",
    "title": {
      "en": "Irreversible Pulpitis",
      "fr": "Pulpite irréversible",
      "de": "Irreversible Pulpitis",
      "ar": "التهاب لب السن اللاعكوس"
    },
    "explanation": {
      "en": "Spontaneous, lingering pain indicates a severe inflammation of the tooth's nerve (pulp). This condition will not heal on its own and requires intervention.",
      "fr": "Une douleur spontanée et persistante indique une inflammation sévère du nerf de la dent (pulpe). Cette condition ne guérira pas d'elle-même et nécessite une intervention.",
      "de": "Spontane, anhaltende Schmerzen deuten auf eine schwere Entzündung des Zahnnervs (Pulpa) hin. Dieser Zustand heilt nicht von selbst und erfordert einen Eingriff.",
      "ar": "يشير الألم التلقائي والمستمر إلى التهاب حاد في عصب السن (اللب). هذه الحالة لن تلتئم من تلقاء نفسها وتتطلب تدخلاً."
    },
    "treatment": {
      "en": "A root canal treatment is necessary to remove the inflamed nerve, clean the canal, and save the tooth.",
      "fr": "Un traitement de canal est nécessaire pour retirer le nerf enflammé, nettoyer le canal et sauver la dent.",
      "de": "Eine Wurzelkanalbehandlung ist notwendig, um den entzündeten Nerv zu entfernen, den Kanal zu reinigen und den Zahn zu erhalten.",
      "ar": "علاج قناة الجذر ضروري لإزالة العصب الملتهب وتنظيف القناة وإنقاذ السن."
    }
  },
  {
    "id": "CARIE_PROFUNDA",
    "title": {
      "en": "Deep Caries",
      "fr": "Carie Profonde",
      "de": "Tiefe Karies",
      "ar": "تسوس عميق"
    },
    "explanation": {
      "en": "Deep caries has reached close to the nerve of the tooth, causing inflammation.",
      "fr": "La carie profonde a atteint une zone proche du nerf de la dent, provoquant une inflammation.",
      "de": "Eine tiefe Karies hat den Nerv des Zahnes fast erreicht und verursacht eine Entzündung.",
      "ar": "وصل التسوس العميق بالقرب من عصب السن، مما يسبب التهابًا."
    },
    "treatment": {
       "en": "Treatment involves the complete removal of all decayed tissue. Then, a biocompatible and protective filling is placed to seal the cavity. Because the decay was close to the nerve, mild sensitivity may persist for a few days. If the pain increases or does not subside, a follow-up evaluation by a dentist is necessary to rule out pulp inflammation that may require root canal treatment.",
    "fr": "Le traitement consiste à éliminer complètement tous les tissus cariés. Ensuite, une obturation biocompatible et protectrice est placée pour sceller la cavité. Comme la carie était proche du nerf, une légère sensibilité peut persister quelques jours. Si la douleur augmente ou ne disparaît pas, une évaluation de suivi par un dentiste est nécessaire pour exclure une inflammation pulpaire nécessitant un traitement de canal.",
    "de": "Die Behandlung umfasst die vollständige Entfernung des kariösen Gewebes. Anschließend wird eine biokompatible, schützende Füllung zum Versiegeln der Kavität gelegt. Da die Karies nervnah war, kann für einige Tage eine leichte Empfindlichkeit bestehen bleiben. Sollten die Schmerzen zunehmen oder nicht abklingen, ist eine zahnärztliche Nachuntersuchung erforderlich, um eine Pulpitis auszuschließen, die eine Wurzelkanalbehandlung erfordern könnte.",
    "ar": "يتضمن العلاج الإزالة الكاملة لجميع الأنسجة المسوسة. بعد ذلك، توضع حشوة واقية ومتوافقة حيوياً لإغلاق التجويف. نظرًا لأن التسوس كان قريبًا من العصب، قد تستمر حساسية طفيفة لبضعة أيام. إذا زاد الألم أو لم يهدأ، فمن الضروري إجراء تقييم متابعة من قبل طبيب الأسنان لاستبعاد التهاب اللب الذي قد يتطلب علاج قناة الجذر."
    }
  },
  {
    "id": "dent_necrosis",
    "title": {
      "en": "Tooth Necrosis with Abscess",
      "fr": "Nécrose dentaire avec abcès",
      "de": "Zahnnekrose mit Abszess",
      "ar": "نخر السن مع خراج"
    },
    "explanation": {
      "en": "The presence of a pimple on the gum (abscess) indicates that the nerve inside the tooth is dead (necrotic) and an infection has formed at the root tip.",
      "fr": "La présence d'un bouton sur la gencive (abcès) indique que le nerf à l'intérieur de la dent est mort (nécrosé) et qu'une infection s'est formée à l'extrémité de la racine.",
      "de": "Das Vorhandensein einer Beule am Zahnfleisch (Abszess) deutet darauf hin, dass der Nerv im Zahn abgestorben (nekrotisch) ist und sich eine Infektion an der Wurzelspitze gebildet hat.",
      "ar": "يشير وجود بثرة على اللثة (خراج) إلى أن العصب داخل السن قد مات (نخر) وأن عدوى قد تكونت عند طرف الجذر."
    },
    "treatment": {
    "en": "A root canal treatment is required to clean the infected tooth and resolve the abscess. A dentist may also prescribe antibiotics, which should only be taken as directed.",
      "fr": "Un traitement de canal est nécessaire pour nettoyer la dent infectée et résorber l'abcès. Un dentiste peut également prescrire des antibiotiques, qui ne doivent être pris que selon ses instructions.",
      "de": "Eine Wurzelkanalbehandlung ist erforderlich, um den infizierten Zahn zu reinigen und den Abszess zu beseitigen. Ein Zahnarzt kann ebenfalls Antibiotika verschreiben, die nur nach Anweisung eingenommen werden dürfen.",
      "ar": "علاج قناة الجذر مطلوب لتنظيف السن المصاب وحل الخراج. قد يصف طبيب الأسنان أيضًا مضادات حيوية، والتي يجب تناولها فقط حسب التوجيهات."
     }
  },
  {
    "id": "healthy_tooth",
    "title": {
      "en": "Healthy Tooth / No Obvious Issue",
      "fr": "Dent saine / Aucun problème évident",
      "de": "Gesunder Zahn / Kein offensichtliches Problem",
      "ar": "سن سليم / لا توجد مشكلة واضحة"
    },
    "explanation": {
      "en": "Based on the provided answers, there are no signs of common dental problems that cause pain. The tooth appears to be healthy from this assessment.",
      "fr": "Sur la base des réponses fournies, il n'y a aucun signe de problèmes dentaires courants qui causent de la douleur. La dent semble être saine d'après cette évaluation.",
      "de": "Basierend auf den gegebenen Antworten gibt es keine Anzeichen für häufige Zahnprobleme, die Schmerzen verursachen. Der Zahn scheint nach dieser Einschätzung gesund zu sein.",
      "ar": "بناءً على الإجابات المقدمة، لا توجد علامات على مشاكل الأسنان الشائعة التي تسبب الألم. يبدو السن سليمًا من هذا التقييم."
    },
    "treatment": {
      "en": "Continue with good oral hygiene. If pain or sensitivity persists, a clinical examination by a dentist is necessary to check for issues not covered by these questions (e.g., hairline cracks, bite issues).",
      "fr": "Continuez avec une bonne hygiène bucco-dentaire. Si la douleur ou la sensibilité persiste, un examen clinique par un dentiste est nécessaire pour vérifier les problèmes non couverts par ces questions (par ex. fissures fines, problèmes d'occlusion).",
      "de": "Fahren Sie mit einer guten Mundhygiene fort. Wenn Schmerzen oder Empfindlichkeit anhalten, ist eine klinische Untersuchung durch einen Zahnarzt erforderlich, um Probleme zu prüfen, die nicht durch diese Fragen abgedeckt sind (z.B. Haarrisse, Bissprobleme).",
      "ar": "استمر في نظافة الفم الجيدة. إذا استمر الألم أو الحساسية، فإن الفحص السريري من قبل طبيب الأسنان ضروري للتحقق من المشاكل التي لا تغطيها هذه الأسئلة (مثل الشقوق الشعرية، مشاكل العض)."
    }
  },
  {
    "id": "dentin_hypersensitivity",
    "title": {
      "en": "Dentin Hypersensitivity",
      "fr": "Hypersensibilité dentinaire",
      "de": "Dentin-Hypersensibilität",
      "ar": "حساسية العاج"
    },
    "explanation": {
      "en": "A short, sharp pain in response to stimuli (like cold or sweet) is a classic sign of exposed dentin, the sensitive layer beneath the tooth's enamel. This is often caused by gum recession or enamel wear.",
      "fr": "Une douleur brève et aiguë en réponse à des stimuli (comme le froid ou le sucré) est un signe classique de la dentine exposée, la couche sensible sous l'émail de la dent. Ceci est souvent causé par une récession gingivale ou l'usure de l'émail.",
      "de": "Ein kurzer, scharfer Schmerz als Reaktion auf Reize (wie Kälte oder Süßes) ist ein klassisches Zeichen für freiliegendes Dentin, die empfindliche Schicht unter dem Zahnschmelz. Dies wird oft durch Zahnfleischrückgang oder Schmelzabnutzung verursacht.",
      "ar": "الألم القصير والحاد استجابة للمنبهات (مثل البرد أو الحلو) هو علامة كلاسيكية على العاج المكشوف، وهي الطبقة الحساسة تحت مينا السن. يحدث هذا غالبًا بسبب انحسار اللثة أو تآكل المينا."
    },
    "treatment": {
      "en": "Use a toothpaste specifically for sensitive teeth. Avoid acidic foods and drinks. A dentist can apply fluoride varnishes or bonding agents to cover the exposed areas.",
      "fr": "Utilisez un dentifrice spécifique pour les dents sensibles. Évitez les aliments et boissons acides. Un dentiste peut appliquer des vernis fluorés ou des agents de liaison pour couvrir les zones exposées.",
      "de": "Verwenden Sie eine Zahnpasta speziell für empfindliche Zähne. Vermeiden Sie saure Speisen und Getränke. Ein Zahnarzt kann Fluoridlacke oder Haftvermittler auftragen, um die freiliegenden Bereiche abzudecken.",
      "ar": "استخدم معجون أسنان مخصص للأسنان الحساسة. تجنب الأطعمة والمشروبات الحمضية. يمكن لطبيب الأسنان تطبيق ورنيش الفلورايد أو مواد لاصقة لتغطية المناطق المكشوفة."
    }
  },
  {
    "id": "septal_syndrome",
    "title": {
      "en": "Septal Syndrome (Food Impaction)",
      "fr": "Syndrome septal (Tassement alimentaire)",
      "de": "Septales Syndrom (Speiseimpaktion)",
      "ar": "متلازمة الحاجز (انحشار الطعام)"
    },
    "explanation": {
      "en": "This describes pain caused by food getting stuck between two teeth, putting pressure on the gum and bone. It often happens if there's a gap or a poor contact point between teeth.",
      "fr": "Ceci décrit une douleur causée par des aliments coincés entre deux dents, exerçant une pression sur la gencive et l'os. Cela se produit souvent s'il y a un espace ou un mauvais point de contact entre les dents.",
      "de": "Dies beschreibt Schmerzen, die durch Speisereste verursacht werden, die zwischen zwei Zähnen stecken bleiben und Druck auf Zahnfleisch und Knochen ausüben. Dies geschieht oft, wenn eine Lücke oder ein schlechter Kontaktpunkt zwischen den Zähnen besteht.",
      "ar": "يصف هذا ألمًا ناتجًا عن انحشار الطعام بين سنين، مما يضع ضغطًا على اللثة والعظم. يحدث هذا غالبًا إذا كانت هناك فجوة أو نقطة تلامس سيئة بين الأسنان."
    },
    "treatment": {
      "en": "Thoroughly clean the area with dental floss. A dentist needs to check the contact between the teeth and may need to adjust or replace a filling to prevent it from happening again.",
      "fr": "Nettoyez soigneusement la zone avec du fil dentaire. Un dentiste doit vérifier le contact entre les dents et pourrait avoir besoin d'ajuster ou de remplacer une obturation pour éviter que cela ne se reproduise.",
      "de": "Reinigen Sie den Bereich gründlich mit Zahnseide. Ein Zahnarzt muss den Kontakt zwischen den Zähnen überprüfen und möglicherweise eine Füllung anpassen oder ersetzen, um ein erneutes Auftreten zu verhindern.",
      "ar": "نظف المنطقة جيدًا بخيط الأسنان. يحتاج طبيب الأسنان إلى فحص التلامس بين الأسنان وقد يحتاج إلى تعديل أو استبدال حشوة لمنع حدوث ذلك مرة أخرى."
    }
  },
  {
    "id": "pericoronitis",
    "title": {
      "en": "Pericoronitis (Wisdom Tooth Inflammation)",
      "de": "Perikoronitis (Weisheitszahnentzündung)",
      "fr": "Péricoronarite (Inflammation de la dent de sagesse)",
      "ar": "التهاب حوائط التاج (التهاب ضرس العقل)"
    },
    "explanation": {
      "en": "Pericoronitis is the inflammation of the gum tissue surrounding a partially erupted tooth, most commonly a wisdom tooth. Food and bacteria get trapped under the gum flap, causing swelling, pain, and infection.",
      "de": "Perikoronitis ist die Entzündung des Zahnfleischgewebes, das einen nur teilweise durchgebrochenen Zahn, meist einen Weisheitszahn, umgibt. Speisereste und Bakterien sammeln sich unter der Zahnfleischkappe an und verursachen Schwellungen, Schmerzen und Infektionen.",
      "fr": "La péricoronarite est l'inflammation du tissu gingival entourant une dent partiellement sortie, le plus souvent une dent de sagesse. La nourriture et les bactéries se coincent sous le capuchon gingival, provoquant un gonflement, des douleurs et une infection.",
      "ar": "التهاب حوائط التاج هو التهاب في أنسجة اللثة المحيطة بالسن الذي بزغ جزئيًا، وغالبًا ما يكون ضرس العقل. ينحشر الطعام والبكتيريا تحت غطاء اللثة، مما يسبب تورمًا وألمًا وعدوى."
    },
    "treatment": {
      "en": "Treatment involves cleaning the area under the gum flap (irrigation). An antibiotic may be prescribed to fight the infection. In many cases, the definitive treatment is the extraction of the wisdom tooth.",
      "de": "Die Behandlung umfasst die Reinigung des Bereichs unter der Zahnfleischkappe (Spülung). Zur Bekämpfung der Infektion kann ein Antibiotikum verschrieben werden. In vielen Fällen ist die endgültige Behandlung die Extraktion des Weisheitszahnes.",
      "fr": "Le traitement consiste à nettoyer la zone sous le capuchon gingival (irrigation). Un antibiotique peut être prescrit pour combattre l'infection. Dans de nombreux cas, le traitement définitif est l'extraction de la dent de sagesse.",
      "ar": "يشمل العلاج تنظيف المنطقة تحت غطاء اللثة (الغسل). قد يتم وصف مضاد حيوي لمكافحة العدوى. في كثير من الحالات، يكون العلاج النهائي هو خلع ضرس العقل."
    }
  }
]
